#include <iostream>
#include <cstdio>
#include <cmath>
using namespace std;
int gcd(int a, int b) {
  if(b == 0) {
    return a;
  }
  else {
    return gcd(b, a % b);
  }
}
int main() {
  int n, i, j, counter;
  scanf("%d", &n);
  counter = 0;
  for(i=2; i<=n; i++) {
    j = gcd(n, i);
    if(j != 1) {
      counter++;
    }
  }
  printf("%d\n", counter);
}

/*
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να διαβάζει ένα φυσικό αριθμό Ν και να εκτυπώνει 
το πλήθος των θετικών φυσικών αριθμών που δεν υπερβαίνουν το Ν και έχουν μη 
τετριμμένους κοινούς διαιρέτες με το Ν. (Οι μη τετριμμένοι διαιρέτες είναι 
μεγαλύτεροι του 1.)

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τον αριθμό Ν. Θεωρήστε δεδομένο ότι το Ν θα είναι 
έγκυρος φυσικός αριθμός και ότι Ν <= 3.000.000.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει ακριβώς έναν φυσικό αριθμό: την απάντησή σας.

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
10
Παράδειγμα εξόδου
6
*/