#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a, counter;
  scanf("%d", &a);
  counter = 0;
  if(a / 10 == 7) {
    counter++;
  }
  if(a % 10 == 7) {
    counter++;
  }
  printf("%d\n", counter);
}

/*
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να δέχεται ένα διψήφιο φυσικό αριθμό και να 
βρίσκει πόσα από τα ψηφία του είναι ίσα με 7.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει το διψήφιο φυσικό αριθμό.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει ακριβώς ένα φυσικό αριθμό μεταξύ 0 και 2 
(συμπεριλαμβανομένων).

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.
Όριο μνήμης: 16 MB.

Παράδειγμα εισόδου
17
Παράδειγμα εξόδου
1

Παράδειγμα εισόδου 2
42
Παράδειγμα εξόδου 2
0

Παράδειγμα εισόδου 3
77
Παράδειγμα εξόδου 3
2
*/