#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a, b;
  scanf("%d %d", &a, &b);
  if((a % 42 == 0 && b % 17 == 0) || (a % 17 == 0 && b % 42 == 0)) {
    printf("yes\n");
  }
  else {
    printf("no\n");
  }
}

/*
Εκφώνηση
Γράψτε ένα πρόγραμμα που να διαβάζει δύο φυσικούς αριθμούς, Α και Β, και να 
βρίσκει αν ο ένας από τους δύο διαιρείται με το 17 και συγχρόνως ο άλλος 
διαιρείται με το 42

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τους δύο αριθμούς Α και Β, χωρισμένους μεταξύ 
τους με ένα κενό διάστημα. Θεωρήστε δεδομένο ότι θα είναι έγκυροι φυσικοί αριθμοί 
μεταξύ των ορίων που αναφέρονται παρακάτω.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει τη λέξη "yes", αν ένας από τους δύο αριθμούς 
διαιρείται με το 17 και ο άλλος με το 42, διαφορετικά τη λέξη "no".

Περιορισμοί
0 <= Α, Β < 1.000.000
Όριο χρόνου εκτέλεσης: 1 sec.
Όριο μνήμης: 16 MB.

Παράδειγμα εισόδου
210 34
Παράδειγμα εξόδου
yes

Παράδειγμα εισόδου 2
1717 4224
Παράδειγμα εξόδου 2
no
*/