#include <iostream>
#include <cstdio>
using namespace std;
int main () {
  int a, i, pow, max;
  scanf("%d", &a);
  pow = 1;
  max = 0;
  for(i=1; i<24; i++){
    pow = pow * 2;
    if(a % pow == 0 && a >= pow) {
      max = i;
    }
  }
  printf("%d\n", max);
}

/*
Εκφώνηση
Γράψτε ένα πρόγραμμα που διαβάζει έναν φυσικό αριθμό Ν και τυπώνει την μεγαλύτερη 
δύναμη του 2 που διαιρεί το Ν.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τον αριθμό N. Να θεωρήσετε δεδομένο ότι θα είναι 
έγκυρος φυσικός αριθμός μεταξύ των ορίων που αναφέρονται παρακάτω.

Δεδομένα εξόδου
Η έξοδος πρέπει να αποτελείται από ακριβώς μία γραμμή που θα περιέχει ακριβώς 
έναν ακέραιο αριθμό, την μεγαλύτερη δύναμη του 2 που διαιρεί το Ν.

Περιορισμοί
1 <= Ν <= 10.000.000

Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
32
Παράδειγμα εξόδου
5

Παράδειγμα εισόδου 2
2016
Παράδειγμα εξόδου 2
5

Παράδειγμα εισόδου 3
99999
Παράδειγμα εξόδου 3
0
*/