include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a, n, sum;
  scanf("%d", &a);
  n = 0;
  sum = 0;
  while(a > 0) {
    n = a % 10;
    a = a / 10;
    sum += n;
  }
  printf("%d\n", sum);
}

/*
Εκφώνηση
Γράψτε ένα πρόγραμμα που διαβάζει έναν φυσικό αριθμό Ν και υπολογίζει το 
άθροισμα των ψηφίων του.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τον αριθμό N. Να θεωρήσετε δεδομένο ότι θα 
είναι έγκυρος φυσικός αριθμός μεταξύ των ορίων που αναφέρονται παρακάτω.

Δεδομένα εξόδου
Η έξοδος πρέπει να αποτελείται από ακριβώς μία γραμμή που θα περιέχει ακριβώς 
έναν ακέραιο αριθμό, το άθροισμα των ψηφίων του Ν.

Περιορισμοί
1 <= Ν <= 10.000.000

Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
32
Παράδειγμα εξόδου
5

Παράδειγμα εισόδου 2
2016
Παράδειγμα εξόδου 2
9

Παράδειγμα εισόδου 3
99999
Παράδειγμα εξόδου 3
45
*/