#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int n, fact, i;
  scanf("%d", &n);
  fact = 1;
  i = 1;
  while(fact <= n) {
    fact = fact * i;
    i++;
  }
  printf("%d\n", (i - 2));
}

/*
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να διαβάζει ένα φυσικό αριθμό Ν > 0 και να 
εκτυπώνει το μέγιστο φυσικό αριθμό του οποίου το παραγοντικό δεν υπερβαίνει το Ν.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τον αριθμό Ν. Θεωρήστε δεδομένο ότι το Ν θα 
είναι έγκυρος φυσικός αριθμός και ότι 0 < Ν < 2.000.000.000.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει ακριβώς έναν φυσικό αριθμό: την απάντησή σας.

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
10
Παράδειγμα εξόδου
3
*/