#include <iostream>
#include <climits>
using namespace std;
int main() {
  std::ios::sync_with_stdio(false);
  int n, a[1000000], i, max, maxhere;
  cin >> n;
  for(i=0; i<n; i++) {
    cin >> a[i];
  }
  max = INT_MIN;
  maxhere = 0;
  for(i=0; i<n; i++) {
    maxhere += a[i];
    if(max < maxhere) {
      max = maxhere;
    }
    if(maxhere < 0) {
      maxhere = 0;
    }
  }
  cout << max << "\n";
}

/*
Εκφώνηση
Δίνεται μια ακολουθία N ακεραίων αριθμών (που μπορεί να είναι αρνητικοί, θετικοί 
ή και μηδέν). Να γράψετε ένα πρόγραμμα το οποίο θα υπολογίζει το μέγιστο άθροισμα 
(οσωνδήποτε) διαδοχικών όρων της ακολουθίας.

Δεδομένα εισόδου
Η πρώτη γραμμή της εισόδου θα περιέχει το πλήθος N των στοιχείων της ακολουθίας. 
Η δεύτερη γραμμή της εισόδου θα περιέχει Ν ακέραιους αριθμούς. Οι αριθμοί θα 
χωρίζονται με κενά διαστήματα, και η απόλυτη τιμή τους θα είναι μικρότερη ή ίση 
του 1000.

Να θεωρήσετε ως δεδομένο ότι 2 <= Ν <= 1.000.000, και ότι η είσοδος θα είναι 
έγκυρη.

Δεδομένα εξόδου
Η έξοδος πρέπει να αποτελείται από μία γραμμή που να περιέχει ακριβώς έναν 
ακέραιο αριθμό, ο οποίος αντιστοιχεί στο μέγιστο άθροισμα διαδοχικών όρων της 
ακολουθίας.

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.
Όριο μνήμης: 64 MB.

Παράδειγμα εισόδου
10
1 5 -1 -6 14 -8 7 2 -5 4
Παράδειγμα εξόδου
15

Παράδειγμα εισόδου 2
10
1 7 -10 -11 9 9 -7 2 12 -4
Παράδειγμα εξόδου 2
25
*/