#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a, b, c;
  scanf("%d %d %d", &a, &b, &c);
  if(a % 42 == b % 42 && a % 42 == c % 42) {
    printf("%d\n", a % 42);
  }
  else {
    printf("no\n");
  }
}

/*
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να δέχεται τρεις φυσικούς αριθμούς και να ελέγχει 
αν το υπόλοιπο της διαίρεσής τους με το 42 είναι ίσο.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τους τρεις φυσικούς αριθμούς, χωρισμένους ανά 
δύο με ένα κενό διάστημα. Θεωρήστε δεδομένο ότι οι αριθμοί θα είναι έγκυροι.

Δεδομένα εξόδου
Μόνο μία γραμμή:
Αν το υπόλοιπο της διαίρεσης των αριθμών με το 42 είναι ίσο, η γραμμή θα περιέχει 
μόνο έναν ακέραιο: αυτό το υπόλοιπο.
Διαφορετικά, η γραμμή θα περιέχει τη λέξη "no".

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
45 87 129
Παράδειγμα εξόδου
3

Παράδειγμα εισόδου 2
42 42 84
Παράδειγμα εξόδου 2
0

Παράδειγμα εισόδου 3
41 42 43
Παράδειγμα εξόδου 3
no
*/