#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a, b;
  scanf("%d %d", &a, &b);
  if(a * b >= 1000 && a * b < 10000) {
    printf("yes\n");
  }
  else {
    printf("no\n");
  }
}

/*
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να διαβάζει δύο φυσικούς αριθμούς και να ελέγχει αν 
το γινόμενό τους είναι ή όχι τετραψήφιος αριθμός.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τους αριθμούς Μ και Ν, χωρισμένους με ένα κενό 
διάστημα. Θεωρήστε δεδομένο ότι τα Μ και Ν θα είναι έγκυροι φυσικοί αριθμοί.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει "yes", αν το γινόμενο των Μ και Ν είναι 
τετραψήφιος αριθμός, διαφορετικά "no".

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.
Όριο μνήμης: 16 MB.

Παράδειγμα εισόδου
6 7
Παράδειγμα εξόδου
no

Παράδειγμα εισόδου 2
85 47
Παράδειγμα εξόδου 2
yes

Παράδειγμα εισόδου 3
812 67
Παράδειγμα εξόδου 3
no
*/