#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a;
  scanf("%d", &a);
  if(a % 4 == 2 && a >= 1930 && a != 1942 && a != 1946) {
    printf("yes\n");
  }
  else {
    printf("no\n");
  }
}

/*
Εκφώνηση
Το παγκόσμιο πρωτάθλημα ποδοσφαίρου (μουντιάλ) διεξήχθη για πρώτη φορά το 1930. 
Από τότε, διοργανώνεται κάθε 4 χρόνια. Όμως, το 1942 και το 1946 δεν έγινε, λόγω 
του πολέμου.

Να γράψετε ένα πρόγραμμα που να διαβάζει ένα έτος και να ελέγχει αν είναι ή όχι 
χρονιά μουντιάλ.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει έναν αριθμό Y: τό έτος που μας ενδιαφέρει.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει "yes", αν το έτος Y έγινε ή πρόκειται να γίνει 
παγκόσμιο πρωτάθλημα ποδοσφαίρου, διαφορετικά "no".

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.
Όριο μνήμης: 16 MB.

Παράδειγμα εισόδου
1970
Παράδειγμα εξόδου
yes

Παράδειγμα εισόδου 2
1942
Παράδειγμα εξόδου 2
no

Παράδειγμα εισόδου 3
2012
Παράδειγμα εξόδου 3
no
*/