#include <iostream>
using namespace std;
int main() {
  std::ios_base::sync_with_stdio(false);
  int n, a, b; 
  cin >> n;
  a = (n % 1000) / 100;
  b = (n % 100000) / 10000;
  cout << a << b << "\n";
}

/* DIY
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να διαβάζει έναν αριθμό και να εκτυπώνει το 2ο και 4ο
ψηφίο του, θεωρώντας ότι η αρίθμηση των ψηφιών του ξεκινάει από το μηδενικό ψηφίο,
δηλαδή το πρώτο από τα δεξία (LSB).

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει έναν αριθμό n: τον αριθμό που μας ενδιαφέρει.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει δύο αριθμούς, χωρίς κενό ανάμεσα, συγκεκριμένα 
πρώτα το 2ο και μετά το 4ο ψηφίο που ζητούνται.

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.
Όριο μνήμης: 16 MB.

Παράδειγμα εισόδου
1970
Παράδειγμα εξόδου
90

Παράδειγμα εισόδου 2
2018153
Παράδειγμα εξόδου 2
11

Παράδειγμα εισόδου 3
23
Παράδειγμα εξόδου 3
00
*/