#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int n, a[1000000], i, j, even, odd, max;
  even = 0;
  odd = 0;
  max = 0;
  scanf("%d", &n);
  for(i=0; i<n; i++) {
    scanf("%d", &a[i]);
  }
  for(i=0; i<n; i++) {
    odd = 0;
    even = 0;
    for(j=i; j<n; j++) {
      if(a[j] % 2 == 0) {
        even++;
      }
      else {
        odd++;
      }
      if(even == odd && odd + even > max) {
        max = odd + even;
      }
    }
  }
  printf("%d\n", max);
}

/*
Εκφώνηση
Δίνεται ακολουθία a_1, ..., a_N αποτελούμενη από N θετικούς ακέραιους αριθμούς. 
Ζητείται να υπολογισθεί το εύρος του μεγαλύτερου διαστήματος στην ακολουθία στο 
οποίο το πλήθος των άρτιων είναι ίσο με το πλήθος των περιττών.

Δεδομένα εισόδου
Η πρώτη γραμμή της εισόδου θα περιέχει το πλήθος των στοιχείων της ακολουθίας Ν. 
Η δεύτερη γραμμή της εισόδου θα περιέχει τους Ν θετικούς ακέραιους αριθμούς της 
ακολουθίας, χωρισμένους με κενά διαστήματα. Να θεωρήσετε δεδομένο ότι η είσοδος 
θα είναι έγκυρη και ότι 2 <= Ν <= 1.000.000.

Δεδομένα εξόδου
Η έξοδος πρέπει να αποτελείται από μία γραμμή που να περιέχει ακριβώς έναν 
ακέραιο αριθμό, το εύρος του μεγαλύτερου διαστήματος στην ακολουθία στο οποίο 
το πλήθος των άρτιων είναι ίσο με το πλήθος των περιττών. Σε περίπτωση που δεν 
υπάρχει τέτοιο διάστημα, η έξοδος πρέπει να είναι 0.

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
5
7 8 9 6 5
Παράδειγμα εξόδου
4

Παράδειγμα εισόδου 2
10
1 2 1 2 1 2 2 1 1 1
Παράδειγμα εξόδου 2
8

Παράδειγμα εισόδου 3
10
4 6 8 2 2 6 8 4 2 8
Παράδειγμα εξόδου 3
0
*/