#include <iostream>
#include <cstdio>
using namespace std;
int main() {
  int a, b, c;
  scanf("%d %d %d", &a, &b, &c);
  if(a <= b && a <= c) {
    printf("%d\n", a);
  }
  else if(b <= a && b <= c) {
    printf("%d\n", b);
  }
  else {
    printf("%d\n", c);
  }
}

/*
Εκφώνηση
Να γράψετε ένα πρόγραμμα που να υπολογίζει τον μικρότερο μεταξύ τριών ακέραιων 
αριθμών.

Δεδομένα εισόδου
Μόνο μία γραμμή που θα περιέχει τους τρεις ακέραιους αριθμούς, χωρισμένους ανά 
δύο με ένα κενό διάστημα. Θεωρήστε δεδομένο ότι οι αριθμοί θα είναι έγκυροι.

Δεδομένα εξόδου
Μόνο μία γραμμή που θα περιέχει τον μικρότερο από τους τρεις.

Περιορισμοί
Όριο χρόνου εκτέλεσης: 1 sec.

Παράδειγμα εισόδου
2 1 3
Παράδειγμα εξόδου
1

Παράδειγμα εισόδου 2
4 2 2
Παράδειγμα εξόδου 2
2

Παράδειγμα εισόδου 3
7 7 7
Παράδειγμα εξόδου 3
7
*/